[
    {
        "id": 101,
        "title": "Full Stack Web Developent",
        "img": "https://i.ibb.co/FXJvqRr/course-1.jpg",
        "category_id": 1,
        "category": "Web Developent",
        "summary": "Build fullstack React.js applications with Node.js, Express.js & MongoDB (MERN) with this project-focused course.",
        "price": 84,
        "info": {
            "duration": "6 month",
            "enrolled_students": "1732",
            "course_type": "Recorded",
            "lesson": "300+",
            "description": "This course now allows you to take your React knowledge to the next level and build fullstack web apps based on React, NodeJS, MongoDB and Express! Building fullstack applications (i.e. frontend + backend) with the MERN stack is very popular - in this course, you will learn it from scratch at the example of a complete project!MERN stands for MongoDB, Express.js, React.js and Node.js - and combined, these four technologies allow you to build amazing web applications. In this course, we'll build an entire project and you will learn how these different technologies work together step by step. We'll first have a look at all the individual building blocks, so that we then can also combine them all into one amazing application by the end of the course."
        },
        "instructor": {
            "name": "Alice",
            "instructor_id": 1,
            "avatar": "https://i.ibb.co/sPcgJG1/author-1.jpg",
            "about": "Alice has been programming for around 12 years and teaching for almost 5 years.Alice has mastered explaining very complex topics in a simple manner that is very understandable."
        }
    },
    {
        "id": 102,
        "title": "Laravel 9 -Build Complete Multi Vendor Ecommerce Project A-Z",
        "img": "https://i.ibb.co/89yzxHD/course-2.webp",
        "category_id": 1,
        "category": "Web Developent",
        "summary": "In This Course, You Will Build Two Different Projects With Laravel 9 Including Complete Multi-Vendor Ecommerce Site A-Z",
        "price": 299,
        "info": {
            "duration": "4 month",
            "enrolled_students": "670",
            "course_type": "Live",
            "lesson": "300+",
            "description": "If you are very serious about learning laravel 9 from beginner to advance. Build up your laravel skill then this course will be the best choice for you. In this course, you will build two different projects. One will be How to build a company website with Laravel 9. Then you will build one complete Advance Multi-Vendor Ecommerce Project with Laravel 9. You will build every project from scratch. This is not just a functional course it's a real-life project base course. Which helps you to become a professional developer."
        },
        "instructor": {
            "name": "Bob",
            "instructor_id": 2,
            "avatar": "https://i.ibb.co/9ZTczQr/author-2.jpg",
            "about": "I'm a web developer with a serious love for teaching I am a founder of eLe easy Learning and a passionate Web Developer, Programmer & Instructor."
        }
    },
    {
        "id": 103,
        "title": "Learn Python: The Complete Python Programming Course",
        "img": "https://i.ibb.co/m5K27pn/course-3.jpg",
        "category_id": 2,
        "category": "Backend Programming",
        "summary": "Learn A-Z everything about Python, from the basics, to advanced topics like Python GUI, Python Data Analysis, and more!",
        "price": 69,
        "info": {
            "duration": "4 month",
            "enrolled_students": "1410",
            "course_type": "Recorded",
            "lesson": "400+",
            "description": "Python has rapidly become one of the most popular programming languages around the world. Compared to other languages such as Java or C++, Python consistently outranks and outperforms these languages in demand from businesses and job availability. The average Python developer makes over $100,000 - this number is only going to grow in the coming years.The best part? Python is one of the easiest coding languages to learn right now. It doesn’t matter if you have no programming experience or are unfamiliar with the syntax of Python. By the time you finish this course, you'll be an absolute pro at programming!"
        },
        "instructor": {
            "name": "Alice",
            "instructor_id": 1,
            "avatar": "https://i.ibb.co/sPcgJG1/author-1.jpg",
            "about": "Alice has been programming for around 12 years and teaching for almost 5 years.Alice has mastered explaining very complex topics in a simple manner that is very understandable."
        }
    },
    {
        "id": 104,
        "title": "NodeJS Tutorial and Projects Course",
        "img": "https://i.ibb.co/V3NS0yR/course-4.png",
        "category_id": 2,
        "category": "Backend Programming",
        "summary": "Learn Node.js by building real-world applications with Node JS, Express, MongoDB.",
        "price": 199,
        "info": {
            "duration": "5 month",
            "enrolled_students": "599",
            "course_type": "Live",
            "lesson": "300+",
            "description": "Welcome to NodeJS Tutorial and Projects Course.I guess let's start by answering the most pressing question first. What is a NodeJS? And even though there are plenty of good answers out there the one that I like the most is this one - NodeJS is an environment to run Javascript outside of the Browser. NodeJS was created in 2009 and it's built on top of Chrome's V8 Javascript Engine. As you are probably aware of, every browser has an engine, a tool that compiles our code down to machine code and Chrome uses one by the name of V8. Since the moment it was created, Node has evolved tremendously, and while there are many things to like about Node, some of the main ones are - large community, since that tremendously saves time on feature development, as well as the fact that with the help of Node, it's never been easier to build Full-Stack Apps, since both Front-End And Back-End are built in one language, and you guessed that language is our beloved Javascript."
        },
        "instructor": {
            "name": "John",
            "instructor_id": 3,
            "avatar": "https://i.ibb.co/4tw4yT2/author-3.png",
            "about": "Hello, I am John Smilga and I am a web developer. I live and work in Sarasota, FL. I spend most of my day, experimenting with HTML, CSS and Javascript (and it's endless list of frameworks). I enjoy coding and the challenge of learning something new everyday. You can also find me at youtube channel Coding Addict."
        }
    },
    {
        "id": 105,
        "title": "Modern React with Redux",
        "img": "https://i.ibb.co/h1S5cMC/course-5.webp",
        "category_id": 3,
        "category": "Frontend Programming",
        "summary": "Master React and Redux with React Router, Webpack, and Create-React-App. Includes Hooks!",
        "price": 79,
        "info": {
            "duration": "3 month",
            "enrolled_students": "3204",
            "course_type": "Recorded",
            "lesson": "200+",
            "description": "Congratulations! You've found the most popular, most complete, and most up-to-date resource online for learning React and Redux!Thousands of other engineers have learned React and Redux, and you can too.  This course uses a time-tested, battle-proven method to make sure you understand exactly how React and Redux work, and will get you a new job working as a software engineer or help you build that app you've always been dreaming about.The difference between this course and all the others: you will understand the design patterns used by top companies to build massively popular web apps."
        },
        "instructor": {
            "name": "Kimberley",
            "instructor_id": 4,
            "avatar": "https://i.ibb.co/N1rGkss/author-4.png",
            "about": "Kimberley has been building complex Javascript front ends for top corporations in the San Francisco Bay Area. With an innate ability to simplify complex topics, Stephen has been mentoring engineers beginning their careers in software development for years, and has now expanded that experience onto Udemy, authoring the highest rated React course. He teaches on Udemy to share the knowledge he has gained with other software engineers.  Invest in yourself by learning from Stephen's published courses."
        }
    },
    {
        "id": 106,
        "title": "Web Design for Beginners: Real World Coding in HTML & CSS",
        "img": "https://i.ibb.co/z8KMFvb/course-6.jpg",
        "category_id": 3,
        "category": "Frontend Programming",
        "summary": "Launch a career as a web designer by learning HTML5, CSS3, responsive design, Sass and more!",
        "price": 49,
        "info": {
            "duration": "3 month",
            "enrolled_students": "84",
            "course_type": "Live",
            "lesson": "70+",
            "description": "You can launch a new career in web development today by learning HTML & CSS. You don't need a computer science degree or expensive software. All you need is a computer, a bit of time, a lot of determination, and a teacher you trust. I've taught HTML and CSS to countless coworkers and held training sessions for fortune 100 companies. I am that teacher you can trust. Don't limit yourself by creating websites with some cheesy site-builder tool. This course teaches you how to take 100% control over your webpages by using the same concepts that every professional website is created with."
        },
        "instructor": {
            "name": "Andrew Williams",
            "instructor_id": 5,
            "avatar": "https://i.ibb.co/b3BhGkN/author-5.jpg",
            "about": "I have written and published a number of books that are available on Amazon, including books on WordPress (WordPress for Beginners 2022), Self-Publishing (Self-Publishing on Amazon 2022), and search engine optimization (SEO 2021). I also run a website called ezSEONews, where I provide tutorials on a number of skills required for running a successful website."
        }
    },
    {
        "id": 107,
        "title": "Fundamentals of Database Engineering",
        "img": "https://i.ibb.co/q9BxrNr/course-7.png",
        "category_id": 4,
        "category": "Database Design & Develpment",
        "summary": "Learn ACID, Indexing, Partitioning, Sharding, Concurrency control, Replication, DB Engines, Best Practices and More!",
        "price": 149,
        "info": {
            "duration": "3 month",
            "enrolled_students": "784",
            "course_type": "Live",
            "lesson": "90+",
            "description": "Database Engineering is a very interesting sector in software engineering. If you are interested in learning about database engineering you have come to the right place. I have curated this course carefully to discuss the Fundamental concepts of database engineering. This course will not teach you SQL or programming languages, however, it will teach you skillsets and patterns that you can apply in database engineering. A few of the things that you will learn are Indexing, Partitioning, Sharding, Replication, b-trees in-depth indexing, Concurrency control, database engines and security, and much more."
        },
        "instructor": {
            "name": "Andrei Neagoie",
            "instructor_id": 6,
            "avatar": "https://i.ibb.co/84Hb7PW/author-6.png",
            "about": "Having been a self taught programmer, he understands that there is an overwhelming number of online courses, tutorials and books that are overly verbose and inadequate at teaching proper skills. Most people feel paralyzed and don't know where to start when learning a complex subject matter, or even worse, most people don't have $20,000 to spend on a coding bootcamp. "
        }
    },
    {
        "id": 108,
        "title": "Become a WordPress Developer: Unlocking Power With Code",
        "img": "https://i.ibb.co/HKpGpT9/course-8.jpg",
        "category_id": 5,
        "category": "CMS",
        "summary": "Learn PHP, JavaScript, WordPress theming & the WP REST API to Create Custom & Interactive WordPress Websites",
        "price": 99,
        "info": {
            "duration": "6 month",
            "enrolled_students": "3484",
            "course_type": "Recorded",
            "lesson": "500+",
            "description": "Unlock the full power of WordPress and go beyond just a blog platform by learning how to code completely custom WordPress powered sites.In 2022, it's never been easier to build a fantastic, responsive website that looks great on computers, tablets, and mobile phones. You can learn Wordpress WITHOUT having to buy web hosting or a domain name.  I'll show you how you can set it all up on your own computer using free tools."
        },
        "instructor": {
            "name": "Andrew Williams",
            "instructor_id": 5,
            "avatar": "https://i.ibb.co/b3BhGkN/author-5.jpg",
            "about": "I have written and published a number of books that are available on Amazon, including books on WordPress (WordPress for Beginners 2022), Self-Publishing (Self-Publishing on Amazon 2022), and search engine optimization (SEO 2021). I also run a website called ezSEONews, where I provide tutorials on a number of skills required for running a successful website."
        }
    },
    {
        "id": 109,
        "title": "Complete Data Science Bootcamp",
        "img": "https://i.ibb.co/4YcdhSB/course-9.png",
        "category_id": 6,
        "category": "Data Science & Analytics",
        "summary": "Complete Data Science Training: Mathematics, Statistics, Python, Advanced Statistics in Python, Machine & Deep Learning",
        "price": 399,
        "info": {
            "duration": "8 month",
            "enrolled_students": "1350",
            "course_type": "Live",
            "lesson": "700+",
            "description": "Extremely Hands-On... Incredibly Practical... Unbelievably Real!This is not one of those fluffy classes where everything works out just the way it should and your training is smooth sailing. This course throws you into the deep end.In this course you WILL experience firsthand all of the PAIN a Data Scientist goes through on a daily basis. Corrupt data, anomalies, irregularities - you name it!"
        },
        "instructor": {
            "name": "Alice",
            "instructor_id": 1,
            "avatar": "https://i.ibb.co/sPcgJG1/author-1.jpg",
            "about": "Alice has been programming for around 12 years and teaching for almost 5 years.Alice has mastered explaining very complex topics in a simple manner that is very understandable."
        }
    },
    {
        "id": 110,
        "title": "iOS App Development for Beginners (Swift, SwiftUI)",
        "img": "https://i.ibb.co/GkcrYSj/course-10.png",
        "category_id": 7,
        "category": "Mobile App Development",
        "summary": "Complete iOS App Development from Scratch to Live on AppStore (Beginner to Expert Level)",
        "price": 259,
        "info": {
            "duration": "5 month",
            "enrolled_students": "950",
            "course_type": "Recorded",
            "lesson": "500+",
            "description": "This Course is about creating an iOS Application, for landing your Dream Job in Company or Starting your own Business, This course mainly focuses on Swift & SwiftUI. One thing I can assure you regarding this course is that after you finish this course you will gain the confidence to complete any Application.Frameworks like CoreData, CoreML, UIKit, SwiftUI, ARKit, Combine, and XCTest will be explained in this course.You will learn how to create Apple Certificates for Push Notifications, and Certifications to distribute your App In to your team or to the world.ou will create 10+ iOS Applications during this course and learn how to manage your code using Git."
        },
        "instructor": {
            "name": "Dr. Angela",
            "instructor_id": 7,
            "avatar": "https://i.ibb.co/5sj3Bmh/author-7.webp",
            "about": "I'm Angela, I'm a developer with a passion for teaching. I'm the lead instructor at the London App Brewery, London's leading Programming Bootcamp. I've helped hundreds of thousands of students learn to code and change their lives by becoming a developer. I've been invited by companies such as Twitter, Facebook and Google to teach their employees."
        }
    },
    {
        "id": 111,
        "title": "Artificial Intelligence A-Z™: Learn How To Build An AI",
        "img": "https://i.ibb.co/pdtDhwF/course-11.jpg",
        "category_id": 8,
        "category": "Artificial Intellegence",
        "summary": "Combine the power of Data Science, Machine Learning and Deep Learning to create powerful AI for Real-World applications!",
        "price": 199,
        "info": {
            "duration": "5 month",
            "enrolled_students": "950",
            "course_type": "Recorded",
            "lesson": "500+",
            "description": "Complete beginner to expert AI skills – Learn to code self-improving AI for a range of purposes. In fact, we code together with you. Every tutorial starts with a blank page and we write up the code from scratch. This way you can follow along and understand exactly how the code comes together and what each line means.Plus, you'll get downloadable Python code templates for every AI you build in the course. This makes building truly unique AI as simple as changing a few lines of code. If you unleash your imagination, the potential is unlimited."
        },
        "instructor": {
            "name": "Dr. Angela",
            "instructor_id": 7,
            "avatar": "https://i.ibb.co/5sj3Bmh/author-7.webp",
            "about": "I'm Angela, I'm a developer with a passion for teaching. I'm the lead instructor at the London App Brewery, London's leading Programming Bootcamp. I've helped hundreds of thousands of students learn to code and change their lives by becoming a developer. I've been invited by companies such as Twitter, Facebook and Google to teach their employees."
        }
    },
    {
        "id": 112,
        "title": "MasterClass Software Testing with Jira & Agile",
        "img": "https://i.ibb.co/zsTjkm1/course-12.jpg",
        "category_id": 8,
        "category": "Artificial Intellegence",
        "summary": "BEST job oriented Software Manual Testing course on real time Project+Interview ques+Resume Prep+ Lifetime Support",
        "price": 279,
        "info": {
            "duration": "4 month",
            "enrolled_students": "1150",
            "course_type": "Live",
            "lesson": "200+",
            "description": "One Single Course to Master everything in Software World. Learn on Agile Scrum Practices, Software Development Life cycle, QA Process, Software Testing methodologies , and Project management tools like Jira, Bugzilla etc."
        },
        "instructor": {
            "name": "Corey O",
            "instructor_id": 8,
            "avatar": "https://thumbs.dreamstime.com/b/businessman-icon-image-male-avatar-profile-vector-glasses-beard-hairstyle-179728610.jpg",
            "about": "Nothing is Impossible. It all depends on how we are Trained on it.Teaching is my Passion. And it’s my Profession. The only Business I know is Spreading the Knowledge.Every QA Professional have a wish of learning trending Automation courses but somehow 90% of them are giving up their thoughts."
        }
    }
]